{"pages":[{"title":"","text":"","link":"/404.html"},{"title":"","text":"关于本博客为游戏吧YX8.XYZ官方博客，主要记录游戏吧的公告存档，站点变动，发展等信息，同时记录一些游戏吧小吧的碎碎念。 FAQ博客设立意义？简单来说主站因为特殊情况暂时无法访问时博客站会顶上。其实光运营主站都有一大堆事项，正常来讲没有必要再多搞个博客什么的（而且这个博客写起来特麻烦），主要是前几天站点搬家，因为大家吐槽之前网站访问速度太慢，所以小吧给站点重新安了个窝，前前后后搞了几天，期间站点访问断断续续的，估计大家也没看到公告，连群里的老油条吧友也坐不住跑来@我，以为小吧被隔离了。。。（我TM真想一疙瘩炫屎你），所以小吧我单独设立一个博客站，主站如果无法访问之时大家来看看博客站就知道什么情况了~ 主站在什么情况下无法访问？ 1.站点搬家、更换主题等对站点改动比较大的操作，会导致站点访问不流畅或无法访问，一般在做比较大的更改之前主站都会全局公告提前3-5天通知，请大家留意~ 2.被攻击。被攻击基本上是每个网站都必须要面对的威胁，不管大站小站，基本都会从各个角度被搞。游戏吧网站作了一些安全防护，但对于一些诸如DDOS攻击是没有办法的，DDOS攻击简单来说就是同一时间超大量的访客访问你的站点而导致站点崩溃，比如十万个人同时访问网站，这样会导致系统资源消耗爆炸性的提升，超过服务器和带宽上限，最终宕机。 3.其它未知情形~ 主站和博客都无法访问肿么办？放心，主站无法访问的情况是有的，这个小吧也承认。但是博客站静态托管于微软开源平台，10000%稳定不宕机。也就说博客站全部都是静态页面且小吧不管理博客服务器的，服务器人家微软云管着呢，毕竟是主站的后方阵地嘛。不过就是某些地方访问会比较慢是真的，毕竟服务器节点在国外~ 如果主站长时间无法访问肿么办？客观来说确实可能会存在这种情况，比如被长时间攻击。虽然目前没遇到，不过这点也请大家放心，攻击别人也是要投入成本的，没有人闲的蛋疼去这个弄一下那个弄一下的；同时小吧在主站某些帖子中也大概提及过，游戏吧下一步计划会彻底解决这些问题，目前已经在规划中，请大家拭目以待！","link":"/about/index.html"}],"posts":[{"title":"荒野大镖客2离线教程","text":"相信大家因为疫情关系肯定都闲赋在家，这次的春节也是过的最不热闹的一次了，不过疫情无情人有情❤️，小吧再自费购入一个大表哥2新号（主要是近期打折199😄），并决定免费开放给这个月底（2月29号）之前加入的吧友，大家都尽量宅在家玩游戏不要出门了💪🎮 还是有很多萌新不知道怎么操作，这里小吧做个教程，基本上STEAM离线都是这个流程。 获取账号本游戏作为游戏吧会员的免费福利，请游戏吧的吧友通过右下角在线客服联系小吧，告知游戏吧的会员名，稍后小吧会通过admin将账号密码私信给你，请会员在个人消息中心查看即可~ 登陆及下载游戏1.首先下载并安装STEAM客户端，然后使用小吧发您的账号密码登陆。 2.账号登陆时会要求输入令牌，请咨询在线客服。 特别注意：1）因为账号公用，设置令牌时为一对一服务，如果你在设置令牌时有吧友正在设置，小吧会告知“此时有人正在设置”，请稍待片刻~2）请保障有良好的网络环境，出现上图时请务必和客服沟通准备一对一服务，客服告知发生令牌后请立即刷新个人消息中心查看令牌码，拿到令牌码务必在20秒内输入，20秒过后需重新申请。3）作为福利，为了防止账号倒卖，首次设置只有两次接收令牌码机会，此后需要令牌会酌情收取费用。4）根据本教程离线设置成功后以后以离线模式登陆不需要令牌，请不要乱上线，上线可能会需要令牌，离线设置成功后不再下发令牌码。5）综上所述，请务必在自己个人电脑上登陆使用，同时保障有良好的网络环境，离线设置成功后千万不要随意注销账号（除非你已经通关或者不想玩了），也不要重装STEAM软件或系统，同时请关闭系统更新功能。 3.登陆后进入上边的库，找到游戏《荒野大镖客2》，点击安装，首次安装会要求设定安装位置，请选择一个较大的分区来存放游戏，该游戏容量较大（115GB），这里花费时间比较多(小吧花了大概7个小时)，请勿关闭电脑，挂机下载便是~ 4.下载完成之后，直接点击开始游戏进入游戏，首次进入游戏还会下载R星一堆组件，请静待全部安装完毕，然后正常进入游戏到游戏菜单，如下图，此时不要进入游戏，直接点击退出游戏，准备设置离线。 离线方法关闭云存档点击左上角的STEAM，选择设置，如下图取消勾选 游戏吧分享的所有离线账号建议都关闭该项，否则别人可能会打乱你的存档进程，取消勾选此项后你的存档就保存在本地了。 设置离线点击左上角的STEAM，选择进入离线模式，然后点击以离线模式重新启动即可~ 开始游戏双击桌面Red Dead Redemption 2图标，选择以离线模式启动即可开始游戏~ 以后每次进入游戏如此操作即可~ 注意事项及建议1、请详细查看上边的收取令牌的特别注意事项；2、要长时间玩此游戏，请关闭WINDOWS系统的自动更新功能，否则系统更新会导致登陆需要令牌；3、此游戏优化一般，要求配置较高，请根据自己的配置酌情调整游戏画面，就低不就高；4、据网上留言，该游戏有闪退BUG，具体表现为游戏到2-8小时会闪退（小吧实测了两天并没遇到），此为官方BUG，如果你遇见此BUG请自行搜索解决方案；5、游戏时务必切换到英文键盘状态(非英文输入法),否则容易闪退；6、此游戏的存档机制比较奇葩，虽然支持手动存档但还没自动存档好用，只能在没有任务瞎逛时才能手动存档，如果在任务中是不能存档的；7、游戏任务通常比较长，如果在任务中不幸落命，请务必选择载入检查点，不要选择重新开始任务，不然你会哭的~","link":"/%E6%95%99%E7%A8%8B/%E9%87%8E%E5%A4%A7%E9%95%96%E5%AE%A22%E7%A6%BB%E7%BA%BF%E6%95%99%E7%A8%8B.html"},{"title":"STEAM商店无法访问修复","text":"近期访问STEAM平台不稳定，卡慢甚至打不开，同时导致游戏吧社区很多图片也无法显示，所以小吧特地出个教程，此方法同样也可以修复游戏吧博客访问卡慢的问题。 STEAM商店修复首先准备修复工具，下载后解压，然后运行，根据图片来操作（工具下载地址位于文末）： 这里刷新出商店地址后点击检测延迟 然后任意选中一个延迟最低 的，点击应用选中就OK了！再访问商店即正常显示。 由于本博客托管于开源社区，同理也可以修复访问卡慢等情况，如下图选择后其它操作和上边都一样： STEAM社区修复通过如上方法修复一般访问STEAM商店就没什么问题了，但是STEAM社区由于某些原因还是无法访问，所以这里需要借助第二个工具，使用方法也是非常简单。 同样下载后解压，如图操作： 第一次启动服务会要求安装证书，安装即可~ 显示服务已启动 社区就可以正常访问了~ 如果社区访问慢或者其它问题可以在设置中换节点，还有其它一些设置项大家可以根据自己情况调节。 修复工具下载： 123链接：https://pan.baidu.com/s/1yowb_x0nlzVHS0UIhi9RPw 提取码：kesj解压码：www.yx8.xyz","link":"/%E6%95%99%E7%A8%8B/%E5%95%86%E5%BA%97%E6%97%A0%E6%B3%95%E8%AE%BF%E9%97%AE%E4%BF%AE%E5%A4%8D.html"},{"title":"【通知】赠品添加解压密码说明","text":"老是有老哥喜欢在线解压呢？先在线解压再下载？咋也不知道这为什么，咱也不敢问。说了N遍无效，决定即日起所有赠品压缩包添加统一解压密码：www.yx8.xyz 。","link":"/%E5%8A%A8%E6%80%81/%E5%85%AC%E5%91%8A/%E8%B5%A0%E5%93%81%E6%B7%BB%E5%8A%A0%E8%A7%A3%E5%8E%8B%E5%AF%86%E7%A0%81%E8%AF%B4%E6%98%8E.html"},{"title":"STEAM正版游戏离线说明","text":"一、如何下载游戏？ 首先下载安装好STEAM客户端； 在此帖复制好你要玩的游戏账号密码，登陆STEAM客户端； 如果提示“正在其它电脑使用”请换个账号或者等待一段时间再登陆；部分账号首次登陆需要令牌，请联系在线客服获取令牌码。 登陆后点击库，找到游戏，点击安装，此时等待游戏下载，点击下面的下载可以查看下载进度。强烈建议大型游戏选择晚间挂机下载 ·如果是还未发售的游戏在发售的前1-3天左右会预先载入，意思就是可以先让玩家把游戏下载到本地，待游戏正式发售日就解锁开玩了， ·下载过程中可能会发生被顶号的情况，注意此时千万不要退出！，游戏还在正常下载，保持这种状态即可！ 如果账号老是被占用还怎么下载游戏，一般这种情况多发生于新游戏刚发售时，解决方法是百度搜索相关游戏资源名加正版分流，比如下载只狼，可以搜索只狼正版分流，下载相关资源按要求解压放到相关目录中，然后再登陆STEAM客户端会发现游戏已经下载完毕了。 二、如何离线游戏？ 下载好游戏后，第一次正常进入游戏到游戏菜单，然后退出游戏，然后在STEAM客户端中，点击左上角的Steam，选择进入离线模式→以离线模式重新启动，重启后下面的状态栏会显示“离线模式”几个字，这样就表示进入到离线模式！可以开始体验正版游戏了！ 注意：部分加密游戏有每日激活数量要求，如遇相关提示请第二天再试！ 下一次进入游戏或打开STEAM，记得选择以离线模式启动！ 注意：操作系统更新会使离线失效，如果需要长期玩某款游戏，建议关闭系统自动更新，WIN7教程，WIN10教程 三、如何更新游戏？更新游戏直接上线账号，游戏会自动更新为最新版，更新后和上边离线操作教程一样设置为离线模式即可~ 四、必看说明 很多人还搞不清楚为何要设置为离线？共享账号的意思就是多人共用一个账号，这样大家可以以最低的成本第一时间享受到正版的体验，但是共享账号的基本问题就是多人用一个账号容易被顶号，因为账号使用时为独占模式无法多人同时在线，如果此时某个人长期在线，就会导致其他人无法登陆账号而玩不了游戏，所以以离线模式启动游戏，不占用账号资源，也不怕被别人顶号，无忧畅玩。 请务必关闭游戏的「云存档」功能！ 云存档功能就是将你在线时的游戏进度实时的保存在云端（STEAM服务器中）,因为是共享账号，假如你没关闭该功能哪天要上线更新一下游戏，此时可能发生覆盖你的本地游戏进度的情况。 注意：并不是所有游戏都有云存档功能，如果没有就不用管。","link":"/%E6%95%99%E7%A8%8B/%E6%AD%A3%E7%89%88%E6%B8%B8%E6%88%8F%E7%A6%BB%E7%BA%BF%E8%AF%B4%E6%98%8E.html"},{"title":"【动态】站点故障通知","text":"目前正在联系主机商，请大家稍后访问站点。 经主机商排查系机房线路故障，修复历时2个半小时，现已恢复正常。","link":"/%E5%8A%A8%E6%80%81/%E5%8A%A8%E6%80%81%E3%80%91%E7%AB%99%E7%82%B9%E6%95%85%E9%9A%9C%E9%80%9A%E7%9F%A5.html"},{"title":"度盘链接说明","text":"最近分享的都是带提取码的，没有公开链接选项，不知道度盘又抽什么风~ 提取码就是下载链接的后面的4个字符，没有就是不需要。 已咨询了客服，没什么鸟用，联想最近度盘一系列变动，估计以后没有直链分享链接了~","link":"/%E5%8A%A8%E6%80%81/%E9%93%BE%E6%8E%A5%E8%AF%B4%E6%98%8E.html"}],"tags":[{"name":"动态","slug":"动态","link":"/tags/%E5%8A%A8%E6%80%81/"},{"name":"通知","slug":"通知","link":"/tags/%E9%80%9A%E7%9F%A5/"},{"name":"STEAM","slug":"STEAM","link":"/tags/STEAM/"},{"name":"正版游戏","slug":"正版游戏","link":"/tags/%E6%AD%A3%E7%89%88%E6%B8%B8%E6%88%8F/"},{"name":"共享账号","slug":"共享账号","link":"/tags/%E5%85%B1%E4%BA%AB%E8%B4%A6%E5%8F%B7/"},{"name":"公告","slug":"公告","link":"/tags/%E5%85%AC%E5%91%8A/"},{"name":"荒野大镖客","slug":"荒野大镖客","link":"/tags/%E8%8D%92%E9%87%8E%E5%A4%A7%E9%95%96%E5%AE%A2/"},{"name":"大作","slug":"大作","link":"/tags/%E5%A4%A7%E4%BD%9C/"},{"name":"R星","slug":"R星","link":"/tags/R%E6%98%9F/"},{"name":"游戏","slug":"游戏","link":"/tags/%E6%B8%B8%E6%88%8F/"},{"name":"大型单机","slug":"大型单机","link":"/tags/%E5%A4%A7%E5%9E%8B%E5%8D%95%E6%9C%BA/"},{"name":"度盘","slug":"度盘","link":"/tags/%E5%BA%A6%E7%9B%98/"},{"name":"网盘","slug":"网盘","link":"/tags/%E7%BD%91%E7%9B%98/"},{"name":"百度","slug":"百度","link":"/tags/%E7%99%BE%E5%BA%A6/"}],"categories":[{"name":"动态","slug":"动态","link":"/categories/%E5%8A%A8%E6%80%81/"},{"name":"教程","slug":"教程","link":"/categories/%E6%95%99%E7%A8%8B/"},{"name":"公告","slug":"动态/公告","link":"/categories/%E5%8A%A8%E6%80%81/%E5%85%AC%E5%91%8A/"}]}